Catalogs/ДокументВходящий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДокументВходящий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаCудебногоЗаседания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВСилу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВынесения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПочты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжникСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокументаСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазванияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Comment>Краткая суть документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокУстраненияНедостатков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрНазвания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НумераторДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НумераторДокументов</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>исх</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>вх</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтадияДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СудебноеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банкротство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесудебноеДелопроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееНазначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Должники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Должники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКогдаВыдан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегионаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудСтатус</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиОтображенияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиОтображенияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазванияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДокументВходящий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПрограмныйИнтерфейс

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Об = РеквизитФормыВЗначение("Объект");
	ОбновитьОтображение();
	
	Если ЗначениеЗаполнено(Объект.Оператор) = Ложь Тогда
		Объект.Оператор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаСоздания) = Ложь Тогда
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипДокумента) = Ложь Тогда
		Объект.ТипДокумента = Перечисления.ТипДокумента.вх;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) И ЗначениеЗаполнено(Объект.ДатаРегистрации) Тогда
		Элементы.ЗарегистрироватьДокумент.Доступность = Ложь;
	КонецЕсли;
	
	ЗаполнитьНазванияДокументов();
	
	ЭтотОбъект.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ДатаСоздания) = Ложь Тогда
		ТекущийОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.НазваниеДокументаСправочник) Тогда
		НазваниеДокумента = ТекущийОбъект.НазваниеДокументаСправочник.ПолноеНаименование;
	Иначе
		НазваниеДокумента = Объект.Ссылка.Метаданные().Синоним;
	КонецЕсли;
	
	ТекущийОбъект.Наименование = СтрШаблон("%1 от %2", НазваниеДокумента, Формат(ТекущийОбъект.ДатаСоздания, "ДЛФ=D"));
	
КонецПроцедуры

#КонецОбласти

#Область Интерфейс

&НаКлиенте
Процедура Поиск(Команда)
	
	Если Команда.Имя = "ПоискПоНомеруКД" Тогда
		СтруктураПоиска = Новый Структура ("Поиск", Элементы.СтрокаПоискаПоНомеруДоговора.ТекстРедактирования);
		Если ЗначениеЗаполнено(СтруктураПоиска.Поиск) = Ложь Тогда
			ПоказатьОповещениеПользователя("Не заполнена строка поиска.");
			Возврат;
		КонецЕсли;
		ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтотОбъект);
		ОткрытьФорму("Справочник.Договоры.ФормаВыбора", СтруктураПоиска, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОбработкаОповещения);
		
		Возврат;
	ИначеЕсли Команда.Имя = "ПоискПоДолжнику" Тогда
		СтруктураПоиска = Новый Структура ("Поиск", Элементы.СтрокаПоискаПоДолжнику.ТекстРедактирования);
		Если ЗначениеЗаполнено(СтруктураПоиска.Поиск) = Ложь Тогда
			ПоказатьОповещениеПользователя("Не заполнена строка поиска.");
			Возврат;
		КонецЕсли;
		ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтотОбъект);
		ОткрытьФорму("Справочник.Должники.ФормаВыбора", СтруктураПоиска, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОбработкаОповещения);
		
		Возврат;
	ИначеЕсли Команда.Имя = "ПоискПоАдресу" ИЛИ Команда.Имя = "ПоискПоОтправителю" Тогда
		Если Команда.Имя = "ПоискПоАдресу" Тогда
			СтрокаПоиска = Элементы.АдресОтправителя.ТекстРедактирования;
		ИначеЕсли Команда.Имя = "ПоискПоОтправителю" Тогда
			СтрокаПоиска = Элементы.Отправитель.ТекстРедактирования;
		КонецЕсли;
		СтруктураПоиска = Новый Структура ("Поиск", СтрокаПоиска);
		Если ЗначениеЗаполнено(СтруктураПоиска.Поиск) = Ложь Тогда
			ПоказатьОповещениеПользователя("Не заполнена строка поиска.");
			Возврат;
		КонецЕсли;
		ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтотОбъект);
		ОткрытьФорму("Справочник.ДокументВходящий.ФормаВыбора", СтруктураПоиска, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОбработкаОповещения);
		
		Возврат;
	ИначеЕсли Команда.Имя = "ПоискПоНомеруДела" Тогда
		СтруктураПоиска = Новый Структура ("Поиск", Элементы.НомерДела.ТекстРедактирования);
	ИначеЕсли Команда.Имя = "ПоискПоСтроке" Тогда
		СтруктураПоиска = Новый Структура ("Поиск", Элементы.СтрокаПоиска.ТекстРедактирования);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПоиска.Поиск) = Ложь Тогда
		ПоказатьОповещениеПользователя("Не заполнена строка поиска.");
		Возврат;
	КонецЕсли;
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтотОбъект);
	ОткрытьФорму("Справочник.ДокументИсходящий.ФормаВыбора", СтруктураПоиска, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОбработкаОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВидимость()
	
	ФормаДокументаВх = ПолучитьФорму("Справочник.ДокументВходящий.Форма.ФормаЭлемента",,, Новый УникальныйИдентификатор);
	
	//ПолучитьФорму("Справочник.ДокументВходящий.Форма.ФормаЭлемента");
	Для Каждого Элемент Из ФормаДокументаВх.Элементы Цикл
		Попытка
			Если Элемент.Видимость = Ложь Тогда
				НайденноеПоле = Элементы.Найти(Элемент.Имя);
				Если НайденноеПоле <> Неопределено Тогда
					НайденноеПоле.Видимость = Ложь;
					НайденноеПоле.АвтоОтметкаНезаполненного = Ложь;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораДокумента(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		Если Ложь Тогда Результат = Справочники.ДокументИсходящий.НайтиПоКоду(""); КонецЕсли;
		
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Договоры") Тогда
			Если Ложь Тогда Результат = Справочники.Договоры.НайтиПоКоду(""); КонецЕсли;
			Объект.Должник = Результат.Владелец;
			Объект.Договор = Результат;
			Объект.Исполнитель = Привязка.ПолучитьСотрудника(Объект.Должник, ТекущаяДатаСеанса());
		ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.Должники") Тогда
			Если Ложь Тогда Результат = Справочники.Должники.НайтиПоКоду(""); КонецЕсли;
			Объект.Должник = Результат;
			Объект.ДолжникСтрокой = Результат;
			СписокДоговоров = ДоговораДолжника(Объект.Должник);
			Если СписокДоговоров.Количество() = 1 Тогда
				Объект.Договор = СписокДоговоров[0].Значение;
			КонецЕсли;
			Объект.Исполнитель = Привязка.ПолучитьСотрудника(Объект.Должник, ТекущаяДатаСеанса());
		ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.ДокументВходящий") Тогда
			ЗаполнитьЗначенияСвойств(Объект, Результат, "Отправитель, АдресОтправителя");
		ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.ДокументИсходящий") Тогда
			ЗаполнитьЗначенияСвойств(Объект, Результат, "Должник, Договор, Стадия, Исполнитель");
			СтруктураЗаполнения = Новый Структура("Отправитель, АдресОтправителя", Результат.Адресат, Результат.АдресАдресата);
			ЗаполнитьЗначенияСвойств(Объект, СтруктураЗаполнения);
		КонецЕсли;
		
		ОбновитьОтображение();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображение()
	
	ПроверитьЗаполнитьДоговорДолжника();
	
	
	Если Объект.Стадия = ПредопределенноеЗначение("Перечисление.СтадияДокумента.ВнутреннееНазначение") Тогда
		ЭтоСудебныйДокумент = Ложь;
	Иначе
		ЭтоСудебныйДокумент = Истина;
	КонецЕсли;
	
	Элементы.ГруппаНеВН.Видимость = ЭтоСудебныйДокумент;
	Элементы.Причина.Видимость = ЭтоСудебныйДокумент;
	Элементы.ГруппаПоискаСудебная.Видимость = ЭтоСудебныйДокумент;
	
	Элементы.СтрокаПоискаПоДолжнику.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Должник);
	Элементы.НомерДоговора.ТолькоПросмотр = ЗначениеЗаполнено(Объект.НомерДоговора);
	
	//ЭтоПовестка = (Объект.НазваниеДокументаСправочник = Константы.ДокументПовестка.Получить());
	//Элементы.грНеобязательныеПоля.Видимость = ЭтоПовестка;
	//Элементы.ДатаCудебногоЗаседания.АвтоВыборНезаполненного = ЭтоПовестка;
	//Элементы.ДатаCудебногоЗаседания.ОтметкаНезаполненного = ЭтоПовестка;
	ВидимостьИзСправочника();
	
КонецПроцедуры

Процедура ВидимостьИзСправочника()
	
	Если ЗначениеЗаполнено(Объект.НазваниеДокументаСправочник) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	НастройкиОтображенияДокументов.НазваниеДокумента КАК НазваниеДокумента,
	               |	НастройкиОтображенияДокументов.ШифрДокумента КАК ШифрДокумента,
	               |	НастройкиОтображенияДокументов.Видимость КАК Видимость,
	               |	НастройкиОтображенияДокументов.Обязательное КАК Обязательное,
	               |	НастройкиОтображенияДокументов.Поле КАК Поле
	               |ИЗ
	               |	Справочник.НастройкиОтображенияДокументов КАК НастройкиОтображенияДокументов
	               |ГДЕ
	               |	(НастройкиОтображенияДокументов.ШифрДокумента = &ШифрДокумента
	               |			ИЛИ НастройкиОтображенияДокументов.НазваниеДокумента ПОДОБНО &НазваниеДокумента)
	               |	И НастройкиОтображенияДокументов.ПометкаУдаления = ЛОЖЬ";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ШифрДокумента", Объект.НазваниеДокументаСправочник);
	Запрос.УстановитьПараметр("НазваниеДокумента", "%" + Объект.НазваниеДокументаСправочник.НазваниеДокумента + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденноеПоле = Элементы.Найти(Выборка.Поле);
		Если НайденноеПоле <> Неопределено Тогда
			НайденноеПоле.Видимость = (Выборка.Видимость = Истина);
			НайденноеПоле.АвтоОтметкаНезаполненного = (Выборка.Обязательное = Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтадияДокументаПриИзменении(Элемент)
	
	ОбновитьОтображение();
	ЗаполнитьНазванияДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокумент(Команда)
	
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) = Ложь Тогда
		УстановитьНомер();
	КонецЕсли;
	Объект.ДатаРегистрации = ТекущаяДата();
	Элементы.ЗарегистрироватьДокумент.Доступность = ЗначениеЗаполнено(Объект.РегистрационныйНомер) = Ложь;
	ЭтаФорма.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНомер()
	
	ПолноеИмя = Метаданные.Справочники.ДокументВходящий.ПолноеИмя();
	СтруктураОтбора = Новый Структура("ТипДокумента", ПолноеИмя);
	ТаблицаСреза = РегистрыСведений.НумераторДокументов.СрезПоследних(ТекущаяДатаСеанса(), СтруктураОтбора);
	Если ТаблицаСреза.Количество() = 0 Тогда
		МЗ = РегистрыСведений.НумераторДокументов.СоздатьМенеджерЗаписи();
		МЗ.ТипДокумента = ПолноеИмя;
		МЗ.ТекущийНомер = 1;
		МЗ.Период = ТекущаяДатаСеанса();
		МЗ.Записать();
		Объект.РегистрационныйНомер = МЗ.ТекущийНомер;
	Иначе
		ТекущийНомер = ТаблицаСреза[0].ТекущийНомер;
		МЗ = РегистрыСведений.НумераторДокументов.СоздатьМенеджерЗаписи();
		МЗ.ТипДокумента = ПолноеИмя;
		МЗ.Период = ТекущаяДатаСеанса();
		МЗ.ТекущийНомер = ТекущийНомер + 1;
		МЗ.Записать();
		Объект.РегистрационныйНомер = МЗ.ТекущийНомер;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДоговораДолжника(Знач Должник)
	
	СписокДоговоров = ОбщийМодульИнформация.ПолучитьДоговорыДолжника(Должник);
	Возврат СписокДоговоров;
	
КонецФункции

&НаКлиенте
Процедура ДолжникПриИзменении(Элемент)
	
	СписокДоговоров = ДоговораДолжника(Объект.Должник);
	Если СписокДоговоров.Количество() = 1 Тогда
		Объект.Договор = СписокДоговоров[0].Значение;
	ИначеЕсли СписокДоговоров.Количество() > 1 Тогда
		Если Ложь Тогда СписокДоговоров = Новый СписокЗначений; КонецЕсли;
		ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораДоговора", ЭтотОбъект);
		СписокДоговоров.ПоказатьВыборЭлемента(ОбработкаОповещения, "Выберите договор");
	Иначе
		ПоказатьОповещениеПользователя(СтрШаблон("У должника %1 нет договоров.", Объект.Должник));
	КонецЕсли;
	
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДоговора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Договор = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОповещениеВыбораНазвания = Новый ОписаниеОповещения("ПослеВыбораНаименования", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораНазванияДокумента",,ЭтотОбъект,,,, ОповещениеВыбораНазвания, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура БН(Команда)
	
	Объект.НомерВходящегоДокумента = "б/н";
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжникОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПоНомеруДоговораПриИзменении(Элемент)
	
	Поиск(ЭтаФорма.Команды.Найти("ПоискПоНомеруКД"));
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Поиск(ЭтаФорма.Команды.Найти("ПоискПоНомеруДела"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазванияДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазванияДокументов.НазваниеДокумента КАК НазваниеДокумента
	               |ИЗ
	               |	Справочник.НазванияДокументов КАК НазванияДокументов
	               |ГДЕ
	               |	1 = 1
	               |	И НазванияДокументов.Стадия = &Стадия
	               |	И НазванияДокументов.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
	
	Если ЗначениеЗаполнено(Объект.Стадия) Тогда
		Запрос.УстановитьПараметр("Стадия", Объект.Стадия);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НазванияДокументов.Стадия = &Стадия", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокНазванийДокументов = Элементы.НазваниеДокументаВыбор.СписокВыбора;
	СписокНазванийДокументов.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокНазванийДокументов.Добавить(Выборка.НазваниеДокумента);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НазваниеДокументаВыбор) Тогда
		Если СписокНазванийДокументов.НайтиПоЗначению(НазваниеДокументаВыбор) = Неопределено Тогда
			НазваниеДокументаВыбор = "";
			ЗаполнитьРасширенияНазванийДокументов();
			ОбновитьНаименованиеДокумента();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасширенияНазванийДокументов()
	
	СписокРаширенийНазванийДокументов = Элементы.РасширениеНазвания.СписокВыбора;
	СписокРаширенийНазванийДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазванияДокументов.РасширениеНазвания КАК РасширениеНазвания
	               |ИЗ
	               |	Справочник.НазванияДокументов КАК НазванияДокументов
	               |ГДЕ
	               |	1 = 1
	               |	И НазванияДокументов.Стадия = &Стадия
	               |	И НазванияДокументов.ТипДокумента = &ТипДокумента
	               |	И НазванияДокументов.НазваниеДокумента = &НазваниеДокумента";
	
	Если ЗначениеЗаполнено(НазваниеДокументаВыбор) = Ложь Тогда
		РасширениеНазвания = "";
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
	Запрос.УстановитьПараметр("НазваниеДокумента", НазваниеДокументаВыбор);
	
	Если ЗначениеЗаполнено(Объект.Стадия) Тогда
		Запрос.УстановитьПараметр("Стадия", Объект.Стадия);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ШаблоныНазванийДокументов.Стадия = &Стадия", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.РасширениеНазвания = "" Тогда
			Продолжить;
		КонецЕсли;
		СписокРаширенийНазванийДокументов.Добавить(Выборка.РасширениеНазвания);
	КонецЦикла;
	
	Если СписокРаширенийНазванийДокументов.НайтиПоЗначению(РасширениеНазвания) = Неопределено Тогда
		СписокРаширенийНазванийДокументов = "";
		РасширениеНазвания = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеДокументаВыборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(НазваниеДокументаВыбор) Тогда
		СброситьВидимость();
		ЗаполнитьРасширенияНазванийДокументов();
		ОбновитьНаименованиеДокумента();
		ОбновитьОтображение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеНазванияПриИзменении(Элемент)
	
	СброситьВидимость();
	ОбновитьНаименованиеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеДокумента()
	
	НаименованиеДокумента = СтрШаблон("%1 %2", ТРег(НазваниеДокументаВыбор), НРег(РасширениеНазвания));
	ЗаполнитьШифрНазвания();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШифрНазвания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазванияДокументов.НазваниеДокумента КАК НазваниеДокумента,
	               |	НазванияДокументов.РасширениеНазвания КАК РасширениеНазвания,
	               |	НазванияДокументов.ШифрНазвания КАК ШифрНазвания,
	               |	НазванияДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НазванияДокументов КАК НазванияДокументов
	               |ГДЕ
	               |	1 = 1
	               |	И НазванияДокументов.Стадия = &Стадия
	               |	И НазванияДокументов.ТипДокумента = &ТипДокумента
	               |	И НазванияДокументов.РасширениеНазвания = &РасширениеНазвания
	               |	И НазванияДокументов.НазваниеДокумента = &НазваниеДокумента";
	
	Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
	Запрос.УстановитьПараметр("НазваниеДокумента", НазваниеДокументаВыбор);
	Запрос.УстановитьПараметр("РасширениеНазвания", РасширениеНазвания);
	
	Если ЗначениеЗаполнено(Объект.Стадия) Тогда
		Запрос.УстановитьПараметр("Стадия", Объект.Стадия);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ШаблоныНазванийДокументов.Стадия = &Стадия", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.ШифрНазвания = Выборка.ШифрНазвания;
		Объект.НазваниеДокументаСправочник = Выборка.Ссылка;
	КонецЦикла;
	
	ВидимостьИзСправочника();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ОбновитьОтображение();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнитьДоговорДолжника();
	
	Если ЗначениеЗаполнено(Объект.Должник) Тогда
		Объект.ДолжникСтрокой = Объект.Должник;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.НомерДоговора = Объект.Договор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПоДолжникуПриИзменении(Элемент)
	
	Поиск(ЭтаФорма.Команды.Найти("ПоискПоДолжнику"));
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Элемент Из Элементы Цикл
		Если Элемент.Вид = ВидПоляФормы.ПолеВвода  И Элемент.АвтоОтметкаНезаполненного = Истина Тогда
			имяРеквизита = СтрЗаменить(Элемент.ПутьКДанным, "Объект.", "");
			ПроверяемоеЗначение = Объект[имяРеквизита];
			Если ЗначениеЗаполнено(ПроверяемоеЗначение) = Ложь Тогда
				СтрокаОповещения = СтрШаблон("Не заполнено значение %1", Элемент.Имя);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОповещения,, Элемент.ПутьКДанным,, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
